# SetWallRecessGroup

## Description
Set the wall recess geometry group associated with the object.

```pascal
PROCEDURE SetWallRecessGroup(
				objectHand    : HANDLE;
				geometryGroup : HANDLE);
```

```python

def vs.SetWallRecessGroup(objectHand, geometryGroup):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHand|HANDLE|Object handle to set the geometry for.|
|geometryGroup|HANDLE|The group containing the new geometry.|

## Version
Availability: from Vectorworks 2020
## Category
* Objects - Custom